In [1]:
#agrupacion de dataframes

In [2]:
import pandas as pd
import numpy as np

In [3]:
valores = {'clave1':['x','x','y','y','z'], 'clave2':['a','b','a','b','a'],
          'datos1':np.random.rand(5), 'datos2':np.random.rand(5)}
valores

{'clave1': ['x', 'x', 'y', 'y', 'z'],
 'clave2': ['a', 'b', 'a', 'b', 'a'],
 'datos1': array([0.87630083, 0.12760648, 0.98974881, 0.94227986, 0.36437572]),
 'datos2': array([0.98815076, 0.88535206, 0.23694381, 0.98811569, 0.60019549])}

In [4]:
dataframe = pd.DataFrame(valores)
dataframe

  clave1 clave2    datos1    datos2
0      x      a  0.876301  0.988151
1      x      b  0.127606  0.885352
2      y      a  0.989749  0.236944
3      y      b  0.942280  0.988116
4      z      a  0.364376  0.600195

In [7]:
grupo1 = dataframe['datos1'].groupby(dataframe['clave1'])
grupo1

In [8]:
grupo1.mean() #calcula valores de la columna 'datos1' agrupados a partir de la clave1

clave1
x    0.501954
y    0.966014
z    0.364376
Name: datos1, dtype: float64

In [9]:
#Agregaci√≥n en Dataframes

In [10]:
valores = [[1,2,3],[4,5,6],[7,8,9],[np.nan,np.nan,np.nan]]
valores

[[1, 2, 3], [4, 5, 6], [7, 8, 9], [nan, nan, nan]]

In [11]:
columnas = list('abc')
columnas

['a', 'b', 'c']

In [12]:
dataframe = pd.DataFrame(valores,columns=columnas)
dataframe

     a    b    c
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [15]:
dataframe.agg(['sum','min']) #suma por columnas y calcula el valor minimo - No tiene en cuenta el Nan

        a     b     c
sum  12.0  15.0  18.0
min   1.0   2.0   3.0

In [16]:
dataframe.agg('sum',axis=1)

0     6.0
1    15.0
2    24.0
3     0.0
dtype: float64